{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "Analyzed the website behavior and noticed that an idea can be posted with an assigned ID that can be voted on."
            },
            {
                "StepNumber": 2,
                "StepString": "Examined HTML source code to understand the layout and elements of the webpage and its voting system."
            },
            {
                "StepNumber": 3,
                "StepString": "Reviewed JavaScript 'index.js' to understand the methods used for voting."
            },
            {
                "StepNumber": 4,
                "StepString": "Identification of a voting procedure challenge that requires solving. A string has to be found so that the MD5 hash of this string exactly matches the challenge."
            },
            {
                "StepNumber": 5,
                "StepString": "Noticed that each challenge string must be found every time it is called, which can be optimized."
            },
            {
                "StepNumber": 6,
                "StepString": "Wrote a script to use a cache which stores all attempts for generating the challenge strings."
            },
            {
                "StepNumber": 7,
                "StepString": "Implemented a smart voter script that utilizes a previously saved cache. This minimizes the time spent on creating strings that match the challenge given by the server."
            },
            {
                "StepNumber": 8,
                "StepString": "Script causes browser to begin voting process. Process continues until more than 250 votes are cast during the same PHP session."
            },
            {
                "StepNumber": 9,
                "StepString": "Observed that obtaining the flag message requires waiting for a response from the server after each vote."
            },
            {
                "StepNumber": 10,
                "StepString": "After reaching 250 votes, flag message is returned by the server."
            }
        ]
    }
}