{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "Started the CTF challenge with a note stating 'under protection' indicating the platform has some security measures",
                "Substeps": [
                    {
                        "SubstepNumber": 1.1,
                        "SubstepString": "Began the CTF challenge."
                    },
                    {
                        "SubstepNumber": 1.2,
                        "SubstepString": "Noticed a note that stated 'under protection', indicating the presence of security measures on the platform."
                    }
                ]
            },
            {
                "StepNumber": 2,
                "StepString": "Suspected it had something to due with security protections such as a WAF after noting the title 'advertisement' and the presence of protected DIG records",
                "Substeps": [
                    {
                        "SubstepNumber": 2.1,
                        "SubstepString": "Speculated a connection with security protections such as WAF after noting certain factors."
                    },
                    {
                        "SubstepNumber": 2.2,
                        "SubstepString": "Noted the title 'advertisement'."
                    },
                    {
                        "SubstepNumber": 2.3,
                        "SubstepString": "Identified the presence of protected DIG records."
                    }
                ]
            },
            {
                "StepNumber": 3,
                "StepString": "Suspected it could be related to Cloudflare protections after examining DIG records",
                "Substeps": [
                    {
                        "SubstepNumber": 3.1,
                        "SubstepString": "Examined the DIG records."
                    },
                    {
                        "SubstepNumber": 3.2,
                        "SubstepString": "Formulated a suspicion of possible Cloudflare protections."
                    }
                ]
            },
            {
                "StepNumber": 4,
                "StepString": "Considered triggering a custom Cloudflare error, but didn't know how to do it",
                "Substeps": [
                    {
                        "SubstepNumber": 4.1,
                        "SubstepString": "Contemplated on triggering a custom Cloudflare error."
                    },
                    {
                        "SubstepNumber": 4.2,
                        "SubstepString": "Lacked the knowledge on how to trigger the aforementioned error."
                    }
                ]
            },
            {
                "StepNumber": 5,
                "StepString": "Recalled an example from a known website (crunchyroll.com) where a Cloudflare error was triggered by SQL injection",
                "Substeps": [
                    {
                        "SubstepNumber": 5.1,
                        "SubstepString": "Recalled an instance from a known website (crunchyroll.com)."
                    },
                    {
                        "SubstepNumber": 5.2,
                        "SubstepString": "Remembered that a Cloudflare error was triggered in the instance by SQL injection."
                    }
                ]
            },
            {
                "StepNumber": 6,
                "StepString": "Tried using an SQL injection on the challenge platform (inputting ' OR 1=1--')",
                "Substeps": [
                    {
                        "SubstepNumber": 6.1,
                        "SubstepString": "Due to the previous step, made an attempt to use an SQL injection on the challenge platform."
                    },
                    {
                        "SubstepNumber": 6.2,
                        "SubstepString": "..by inputting ' OR 1=1--'"
                    }
                ]
            },
            {
                "StepNumber": 7,
                "StepString": "Received a custom error with the flag as a response, resulting in successful completion of the challenge",
                "Substeps": [
                    {
                        "SubstepNumber": 7.1,
                        "SubstepString": "Received a custom error as a response to the SQL injection."
                    },
                    {
                        "SubstepNumber": 7.2,
                        "SubstepString": "The flag was found in the error, leading to successful completion of the challenge."
                    }
                ]
            }
        ]
    }
}