{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "Define the URL of the website that the SQL Injection will be performed on."
            },
            {
                "StepNumber": 2,
                "StepString": "Initialize an empty password string for storing the inferred password."
            },
            {
                "StepNumber": 3,
                "StepString": "Create an infinite loop that will run until the password is fully determined using the SQL Injection."
            },
            {
                "StepNumber": 4,
                "StepString": "Loop through each character in '0123456789abcdef' (hexadecimal)."
            },
            {
                "StepNumber": 5,
                "StepString": "Create a SQL Injection payload that uses a wildcard pattern and append the current character. 'or password like {}{}%' --' would check if the password starts with the current guessed string."
            },
            {
                "StepNumber": 6,
                "StepString": "Send a POST request with the crafted payload to the target URL."
            },
            {
                "StepNumber": 7,
                "StepString": "Check the response for the text 'No such person'. If this string is not found, it means that the guess was correct -- that character exists in the password at that position."
            },
            {
                "StepNumber": 8,
                "StepString": "Append the current character to the password string and output it, along with a section of the server response trimmed by slicing."
            },
            {
                "StepNumber": 9,
                "StepString": "Use the flag variable to denote a successful guess. If a guess was successful, restart the loop to guess the next character."
            },
            {
                "StepNumber": 10,
                "StepString": "If a guess was not successful (denoted by the flag remaining False after the loop), it means the full password has been guessed. Break the infinite loop and exit the script."
            }
        ]
    }
}