{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "Access the provided source code and link to the running instance upon starting the challenge instance."
            },
            {
                "StepNumber": 2,
                "StepString": "Examine the website interface, which includes a login screen and a main screen with book selections."
            },
            {
                "StepNumber": 3,
                "StepString": "Analyze key aspects of the code, such as JwtService.java and SecretGenerator.Java, to better understand the website's security processes."
            },
            {
                "StepNumber": 4,
                "StepString": "Identify that the 'secret key' is '1234', which yields information for encoding and decoding JWT tokens."
            },
            {
                "StepNumber": 5,
                "StepString": "Utilize the Google Chrome Network tab to login with given credentials, and capture the payload of the response, which includes a JWT token"
            },
            {
                "StepNumber": 6,
                "StepString": "Copy the JWT token and decode it using a website such as jwt.io to obtain a 'userId', in this case observed to be '1'."
            },
            {
                "StepNumber": 7,
                "StepString": "Encode a new JWT token with role 'Admin'."
            },
            {
                "StepNumber": 8,
                "StepString": "Examine the file UserController.java in the 'controllers' directory to discover useful endpoints."
            },
            {
                "StepNumber": 9,
                "StepString": "Use Postman, or a similar tool, to send requests with the new 'Admin' JWT token to update the user role and access the flag."
            },
            {
                "StepNumber": 10,
                "StepString": "Create a new user on the site since the default user role cannot be modified."
            },
            {
                "StepNumber": 11,
                "StepString": "Send a request to obtain a list of users and identify the new user's id."
            },
            {
                "StepNumber": 12,
                "StepString": "Send a request to patch the new user's role to 'Admin'."
            },
            {
                "StepNumber": 13,
                "StepString": "Login with the newly promoted 'Admin' user and access the book containing the flag."
            }
        ]
    }
}