{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "First step: Analyzed the challenge website where notes could be created and searched.",
                "Substeps": [
                    {
                        "SubstepNumber": 1.1,
                        "SubstepString": "Analyzed the challenge website where notes could be created and searched."
                    }
                ]
            },
            {
                "StepNumber": 2,
                "StepString": "Second step: Investigated the search function which uses a 302 server-side redirect to '/view' if a note matching the query is found.",
                "Substeps": [
                    {
                        "SubstepNumber": 2.1,
                        "SubstepString": "Investigated the search function."
                    },
                    {
                        "SubstepNumber": 2.2,
                        "SubstepString": "Observed the usage of 302 server-side redirect to '/view' for a matching note."
                    }
                ]
            },
            {
                "StepNumber": 3,
                "StepString": "Third step: Discovered that an oracle could be used to determine whether the flag obtained is correct.",
                "Substeps": [
                    {
                        "SubstepNumber": 3.1,
                        "SubstepString": "Discovered the possibility of using an oracle."
                    },
                    {
                        "SubstepNumber": 3.2,
                        "SubstepString": "Noted the purpose of the oracle in determining flag correctness."
                    }
                ]
            },
            {
                "StepNumber": 4,
                "StepString": "Fourth step: Confirmed that the SameSite attribute of the cookies is set to None.",
                "Substeps": [
                    {
                        "SubstepNumber": 4.1,
                        "SubstepString": "Confirmed the SameSite attribute of the cookies."
                    }
                ]
            },
            {
                "StepNumber": 5,
                "StepString": "Fifth step: Researched the Fetch API's limit of 20 redirects before a network error is returned.",
                "Substeps": [
                    {
                        "SubstepNumber": 5.1,
                        "SubstepString": "Researched the Fetch API's limit of 20 redirects causing a network error."
                    }
                ]
            },
            {
                "StepNumber": 6,
                "StepString": "Sixth step: Identified an exploit: if a 302 redirect is detected this indicates that the flag leaks due to the network error from exceeding the Fetch API redirect limit.",
                "Substeps": [
                    {
                        "SubstepNumber": 6.1,
                        "SubstepString": "Identified the exploitation of a 302 redirect."
                    },
                    {
                        "SubstepNumber": 6.2,
                        "SubstepString": "Noted the flag leakage due to Fetch API redirect limit."
                    }
                ]
            },
            {
                "StepNumber": 7,
                "StepString": "Seventh step: Created an attacker server to make 19 redirects.",
                "Substeps": [
                    {
                        "SubstepNumber": 7.1,
                        "SubstepString": "Created an attacker server."
                    },
                    {
                        "SubstepNumber": 7.2,
                        "SubstepString": "Configured the attacker server to make 19 redirects."
                    }
                ]
            },
            {
                "StepNumber": 8,
                "StepString": "Eighth step: Made the attacker server redirect to the target URL after 19 redirects.",
                "Substeps": [
                    {
                        "SubstepNumber": 8.1,
                        "SubstepString": "Redirected the attacker server to the target URL after 19 redirects."
                    }
                ]
            },
            {
                "StepNumber": 9,
                "StepString": "Nineth step: Utilized script to make the client request to exploit the limit of 20 redirects using Fetch API.",
                "Substeps": [
                    {
                        "SubstepNumber": 9.1,
                        "SubstepString": "Utilized script to make the client request."
                    },
                    {
                        "SubstepNumber": 9.2,
                        "SubstepString": "Exploited the limit of 20 redirects using Fetch API."
                    }
                ]
            },
            {
                "StepNumber": 10,
                "StepString": "Tenth step: Created a PHP script to redirect to itself 19 times, before redirecting to the target URL.",
                "Substeps": [
                    {
                        "SubstepNumber": 10.1,
                        "SubstepString": "Created a PHP script."
                    },
                    {
                        "SubstepNumber": 10.2,
                        "SubstepString": "Configured the PHP script to redirect to itself 19 times."
                    },
                    {
                        "SubstepNumber": 10.3,
                        "SubstepString": "Redirected the PHP script to the target URL after 19 redirects."
                    }
                ]
            },
            {
                "StepNumber": 11,
                "StepString": "Eleventh step: Tested this method to successfully bruteforce the flag letter by letter.",
                "Substeps": [
                    {
                        "SubstepNumber": 11.1,
                        "SubstepString": "Tested the method."
                    },
                    {
                        "SubstepNumber": 11.2,
                        "SubstepString": "Bruteforced the flag letter by letter."
                    }
                ]
            }
        ]
    }
}