{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "Enter the website and encounter a login page. Type a random base username and password for the login"
            },
            {
                "StepNumber": 2,
                "StepString": "See a page notifying about an incorrect login, and suggesting to visit recently acquired companies. Notice that one of the mentioned company names points to 'Robots.txt'"
            },
            {
                "StepNumber": 3,
                "StepString": "Visit the robots.txt page for the site and find a message about using an unsupported browser, more specifically Internet Explorer 6.01"
            },
            {
                "StepNumber": 4,
                "StepString": "Acquire the User-Agent string for Internet Explorer 6.01"
            },
            {
                "StepNumber": 5,
                "StepString": "Change the browser's user agent to IE 6.01 through developer tools in the browser"
            },
            {
                "StepNumber": 6,
                "StepString": "Reload the website page with the new user-agent and find a message containing a 'secret key' for the cookies"
            },
            {
                "StepNumber": 7,
                "StepString": "Identify the 'secret key' for the site's cookies: flour_sugar_chocolate_and_lotsalove"
            },
            {
                "StepNumber": 8,
                "StepString": "Obtain your current cookie by going to 'Inspect' -> 'Storage' -> 'Cookies' and get the cookie's value"
            },
            {
                "StepNumber": 9,
                "StepString": "Decode the session data from the cookie using Base64 decoding on a site like cyberchef"
            },
            {
                "StepNumber": 10,
                "StepString": "Identify that you need change the 'admin' field to 'true'. However, you need the secret key due to Flask's hash based on session data, timestamp, and the secret key"
            },
            {
                "StepNumber": 11,
                "StepString": "To find the session cookie, set the session's 'admin' field to 'true' and run a script with the site's 'secret key' included"
            },
            {
                "StepNumber": 12,
                "StepString": "Use the new session cookie to log into the site, either by intercepting an HTTP request or using a cookie editor tool"
            },
            {
                "StepNumber": 13,
                "StepString": "Once the new cookie has been inputted, press 'login' on the login page to access the site and find the flag"
            }
        ]
    }
}