{
    "AttackModel": {
        "Steps": [
            {
                "StepNumber": 1,
                "StepString": "Step 1: The author identifies it as a SQL Injection challenge and sets up the environment to exploit it.",
                "Substeps": [
                    {
                        "SubstepNumber": 1.1,
                        "SubstepString": "The author identifies it as a SQL Injection challenge."
                    },
                    {
                        "SubstepNumber": 1.2,
                        "SubstepString": "The author sets up the environment to exploit the SQL Injection challenge."
                    }
                ]
            },
            {
                "StepNumber": 2,
                "StepString": "Step 2: Para meters and values such as 'domain', 'check', 'key', and 'column' are initialized to be manipulated later.",
                "Substeps": [
                    {
                        "SubstepNumber": 2.1,
                        "SubstepString": "Para meters and values such as 'domain', 'check', 'key', and 'column' are initialized."
                    },
                    {
                        "SubstepNumber": 2.2,
                        "SubstepString": "These parameters are set up to be manipulated later."
                    }
                ]
            },
            {
                "StepNumber": 3,
                "StepString": "Step 3: The author sets a condition to set these parameters based on the specific challenge, as this solution also works for the 'Gate Keeper' challenge.",
                "Substeps": [
                    {
                        "SubstepNumber": 3.1,
                        "SubstepString": "The author sets a condition to set the parameters based on the specific challenge."
                    },
                    {
                        "SubstepNumber": 3.2,
                        "SubstepString": "This solution works for the 'Gate Keeper' challenge as well."
                    }
                ]
            },
            {
                "StepNumber": 4,
                "StepString": "Step 4: While the condition to receive the CTF password (flag) not met, the script will continue iterating.",
                "Substeps": [
                    {
                        "SubstepNumber": 4.1,
                        "SubstepString": "The condition to receive the CTF password (flag) is checked."
                    },
                    {
                        "SubstepNumber": 4.2,
                        "SubstepString": "If the condition is not met, the script continues iterating."
                    }
                ]
            },
            {
                "StepNumber": 5,
                "StepString": "Step 5: In each iteration, the author forms SQL Injection payload with progressively appended characters from the 'domain'.",
                "Substeps": [
                    {
                        "SubstepNumber": 5.1,
                        "SubstepString": "In each iteration, the author forms SQL Injection payload."
                    },
                    {
                        "SubstepNumber": 5.2,
                        "SubstepString": "The characters from the 'domain' are progressively appended to the payload."
                    }
                ]
            },
            {
                "StepNumber": 6,
                "StepString": "Step 6: The payload is sent to the target URL via POST request. The data content for the request is constructed dynamically with the key-value pair where the key is retrieved from the 'key' variable and the value is the payload.",
                "Substeps": [
                    {
                        "SubstepNumber": 6.1,
                        "SubstepString": "The payload is sent to the target URL via POST request."
                    },
                    {
                        "SubstepNumber": 6.2,
                        "SubstepString": "The data content for the request is constructed dynamically with a key-value pair."
                    },
                    {
                        "SubstepNumber": 6.3,
                        "SubstepString": "The key for the key-value pair is retrieved from the 'key' variable."
                    },
                    {
                        "SubstepNumber": 6.4,
                        "SubstepString": "The value for the key-value pair is the payload."
                    }
                ]
            },
            {
                "StepNumber": 7,
                "StepString": "Step 7: A check is performed to see if the response text contains 'check', a predefined string that is expected in the response of the successful login.",
                "Substeps": [
                    {
                        "SubstepNumber": 7.1,
                        "SubstepString": "A check is performed on the response text."
                    },
                    {
                        "SubstepNumber": 7.2,
                        "SubstepString": "The check is to see if the response text contains 'check'."
                    },
                    {
                        "SubstepNumber": 7.3,
                        "SubstepString": "'check' is a predefined string expected in the response of a successful login."
                    }
                ]
            },
            {
                "StepNumber": 8,
                "StepString": "Step 8: If the check is successful, it indicates that the payload was able to pass through SQL Injection leading to valid login and the iterated character is added to 'flag'.",
                "Substeps": [
                    {
                        "SubstepNumber": 8.1,
                        "SubstepString": "If the check is successful, it indicates that the payload was able to pass through SQL Injection."
                    },
                    {
                        "SubstepNumber": 8.2,
                        "SubstepString": "A valid login has been achieved."
                    },
                    {
                        "SubstepNumber": 8.3,
                        "SubstepString": "The iterated character is added to the 'flag'."
                    }
                ]
            },
            {
                "StepNumber": 9,
                "StepString": "Step 9: The 'flag' value updates with the successful character, and it repeats the process until the end of the flag is found.",
                "Substeps": [
                    {
                        "SubstepNumber": 9.1,
                        "SubstepString": "The 'flag' value updates with the successful character."
                    },
                    {
                        "SubstepNumber": 9.2,
                        "SubstepString": "The process is repeated until the end of the flag is found."
                    }
                ]
            }
        ]
    }
}